---
type: StartingViewSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# StartingViewSettings

`Autodesk.Revit.DB.StartingViewSettings` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetStartingViewSettings | 2012 | `public static StartingViewSettings GetStartingViewSettings ( Document doc )` |
| Method | IsAcceptableStartingView | 2012 | `public bool IsAcceptableStartingView ( ElementId viewId )` |
| Property | Parameter | — | `` |
| Property | ViewId | 2012 | `public ElementId ViewId { get ; set ; }` |